<html><head>
      <meta http-equiv="Content-Type" content="text/html; charset=ISO-8859-1">
   <title>CacheWolf Dokumentation</title><link rel="stylesheet" href="html.css" type="text/css"><meta name="generator" content="DocBook XSL Stylesheets V1.70.1"></head><body bgcolor="white" text="black" link="#0000FF" vlink="#840084" alink="#0000FF"><div class="book" lang="en"><div class="titlepage"><div><div><h1 class="title"><a name="d0e1"></a>CacheWolf Dokumentation</h1></div></div><hr></div><div class="toc"><dl><dt><span class="chapter"><a href="#d0e4">1. Installation</a></span></dt><dd><dl><dt><span class="section"><a href="#d0e34">1.1. Welche Cachewolf - Version f&uuml;r was?</a></span></dt><dd><dl><dt><span class="section"><a href="#d0e38">1.1.1. Windows</a></span></dt><dt><span class="section"><a href="#d0e43">1.1.2. Java</a></span></dt><dt><span class="section"><a href="#d0e52">1.1.3. Pocket PC</a></span></dt><dd><dl><dt><span class="section"><a href="#d0e111">1.1.3.1. Wichtige Information zur Nutzung von GPS Empf&auml;ngern</a></span></dt></dl></dd><dt><span class="section"><a href="#d0e127">1.1.4. Zaurus</a></span></dt></dl></dd></dl></dd></dl></div><div class="chapter" lang="en"><div class="titlepage"><div><div><h2 class="title"><a name="d0e4"></a>Chapter&nbsp;1.&nbsp;Installation</h2></div><div><div class="author"><h3 class="author"><span class="surname">Marc Schnitzler</span></h3></div></div><div><p class="releaseinfo">Review f&uuml;r Freigabe</p></div><div><div class="revhistory"><table border="1" width="100%" summary="Revision history"><tr><th align="left" valign="top" colspan="3"><b>Revision History</b></th></tr><tr><td align="left">Revision 0.1</td><td align="left">7. September 2007</td><td align="left"><span class="surname">Marc Schnitzler<br></span></td></tr><tr><td align="left" colspan="3"><p>Erster Entwurf, kopiert www.cachewolf.de</p></td></tr></table></div></div></div></div><p>Cachewolf ist verf&uuml;gbar in verschiedenen Versionen f&uuml;r Windows, Linux, PocketPC (ARM/PPC) und Zaurus. Die prim&auml;re Downloadseite ist BerliOS, als Alternative kannst du dir den Cachewolf auch direkt unter <code class="uri">http://www.cachewolf.de/wiki/pmwiki.php/Main/Download</code> herunterladen.</p><div class="section" lang="en"><div class="titlepage"><div><div><h2 class="title" style="clear: both"><a name="d0e34"></a>1.1.&nbsp;Welche Cachewolf - Version f&uuml;r was?</h2></div></div></div><p></p><div class="section" lang="en"><div class="titlepage"><div><div><h3 class="title"><a name="d0e38"></a>1.1.1.&nbsp;Windows</h3></div></div></div><p>Hier ist die Installation sehr einfach. Einfach die .zip-Datei in ein Verzeichnis Deiner Wahl entpacken. Durch einen Doppelklick auf das CacheWolf Icon startet das Programm.</p></div><div class="section" lang="en"><div class="titlepage"><div><div><h3 class="title"><a name="d0e43"></a>1.1.2.&nbsp;Java</h3></div></div></div><p>F&uuml;r den Einsatz der Java-Version ben&ouml;tigst du eine Java-Runtime in der Version 1.5 oder h&ouml;her. Diese bekommst du entweder direkt bei Sun oder &uuml;ber die Linux-eigene Paketverwaltung (SuSE: YaST, Debian: apt-get,...).</p><p>&Uuml;ber die Kommandozeile startest du das Programm mittels: <code class="literal">java -jar "/Pfadzucachewolf/CacheWolf.jar" &amp;</code></p></div><div class="section" lang="en"><div class="titlepage"><div><div><h3 class="title"><a name="d0e52"></a>1.1.3.&nbsp;Pocket PC</h3></div></div></div><p>Der Cachewolf l&auml;uft auf PocketPC's &uuml;ber eine sogenannte virtuelle Maschine (EWE VM). Diese stellt die Grundlage aller Funktionen des CW dar und dadurch l&auml;uft er auf fast allen PocketPC's.</p><p>Es existieren zwei optimierte Versionen von Cachewolf f&uuml;r den PocketPC: f&uuml;r Ger&auml;te mit ARM-Prozessor und f&uuml;r Ger&auml;te mit Intel-Prozessor. Welche Version ben&ouml;tigt wird, kann man auch durch Probieren ermitteln. (Teilweise laufen auch beide Versionen.)</p><p>CacheWolf erkennt &uuml;brigens VGA-Ger&auml;te und stellt die Aufl&ouml;sung entsprechend ein.</p><table bgcolor="#FFFFCC"><tr><td><div class="highlights"><p>Aus der FAQ:</p><p>Frage 3: Welche Version von CacheWolf ist die richtige f&uuml;r mein Pocket PC?</p><p>Antwort: Diese Frage ist leider nicht so einfach zu beantworten.</p><p>Auf dieser Seite www.pocketpc-users.de gibt es eine sehr gute Beschreibung.</p><p>Vielleicht hilft aber folgende (kurze) Zusammenfassung:</p><p>* Hast Du ein Pocket PC 2000 Ger&auml;t, dann benutzt es wahrscheinlich einen ARM (kompatiblen) Prozessor. Es gibt allerdings Ausnahmen, die einen SH3 oder MIPS Prozessor nutzen.</p><p>* Pocket PC 2002 und 2003 Ger&auml;te nutzen ausschlie&szlig; einen ARM (kompatiblen) Prozessor.</p><p>* Hast Du eine Ger&auml;t, da&szlig; Du in der zweiten H&auml;lfte 2004 gekauft hast, dann solltest Du die "PocketPC" Version von CacheWolf installieren. Beispiele (von Nutzern): PocketPCArm: XDA Trion, ASUS632,Yakumo Delta GPS, Loox N520, Compaq IPAQ 6915, Medion MDPPC250, FSC Loox N560, Dell Axim X51V, Yakumo DeltaX5BT, Acer N35 PocketPC: Loox N520, Mio Digi Walker P550 Zaurus: Sharp SL-C1000</p><p>Sagt dir das alles gar nichts probier einfach die Versionen durch - eine wird auf jeden Fall funktionieren!</p></div></td></tr></table><p>Die Installation ist ein mehrstufiger Prozess:</p><div class="itemizedlist"><ul type="disc"><li><p>Zuerst muss die EWE VM (Virtual Machine) installiert werden:</p><div class="itemizedlist"><ul type="circle"><li><p>EWE VM unter <code class="uri">http://www.ewesoft.com/Downloads/Downloads.html#_Toc105819897</code> herunterladen.</p><p>Hier darauf achten, die richtige Version ("Low Resolution" f&uuml;r normale PDA's oder "High Resolution" f&uuml;r VGA-PDA's zu laden.</p></li><li><p>Installation der VM wie unter dem Download Link beschrieben: die cab-Datei auf den PDA &uuml;bertragen (mittels Speicherkarte oder ActiveSync) und dann auf dem PDA ausf&uuml;hren.</p></li><li><p>Nach erfolgter Installation unter Start -&gt; Programme -&gt; EWE das Programm EWE starten. Damit werden noch notwendige Systemeintr&auml;ge gemacht und die VM ist nun funktionsf&auml;hig. Das Programm wieder schlie&szlig;en und die Funktion &uuml;berpr&uuml;fen, indem eines der beiligenden Programme (z.B. Solitaire) gestartet wird.</p></li></ul></div></li><li><p>Die entsprechende CacheWolf .zip-Datei auf dem PC entpacken.</p></li><li><p>Die ganzen Dateien dann auf den PocketPC in ein Verzeichnis deiner Wahl kopiert werden.</p></li><li><p>Nach dem Kopieren wird CacheWolf durch Klick auf die Cachewolf.exe gestartet.</p></li></ul></div><p></p><div class="section" lang="en"><div class="titlepage"><div><div><h4 class="title"><a name="d0e111"></a>1.1.3.1.&nbsp;Wichtige Information zur Nutzung von GPS Empf&auml;ngern</h4></div></div></div><p>Bevor der Cachewolf sauber l&auml;uft gilt es, je nach PDA ein paar Hindernisse zu umschiffen (die aber nicht vom CW stammen!).</p><div class="orderedlist"><ol type="1"><li><p><span class="bold"><strong>Zugriff auf GPS:</strong></span> Solltest du neben dem CW noch weitere Software einsetzen (z.B. Navi-Software), die Zugriff auf das GPS haben will so kann es (je nach Software und PDA) vorkommen dass diese Software - einmal gestartet - den Zugriff auf das GPS exklusiv nimmt und andere Programme das nachsehen haben (auch wenn z.B. die Navi-Software gerade nicht mehr l&auml;uft!) \\ Die L&ouml;sung besteht darin, das GPS-Signal zu splitten, was beispielsweise der VirtCommMgr kann.</p></li><li><p><span class="bold"><strong>Static Navigation:</strong></span> dies bezeichnet ein "Feature" f&uuml;r Navis, die die Routenf&uuml;hrung aussetzt wenn man sich langsamer als 6 km/h bewegt. F&uuml;rs cachen nat&uuml;rlich etwas doof, aber man kann es (ohne Nebenwirkungen f&uuml;r Navi-Software) abschalten - z.B. mittels des Programms SirfTech.</p></li></ol></div></div></div><div class="section" lang="en"><div class="titlepage"><div><div><h3 class="title"><a name="d0e127"></a>1.1.4.&nbsp;Zaurus</h3></div></div></div><p>Wie auch beim PocketPC ist die Installation ein mehrstufiger Prozess.</p><div class="itemizedlist"><ul type="disc"><li><p>Zuerst muss die EWE VM (Virtual Machine) installiert werden: Download hier: <code class="uri">http://www.ewesoft.com/Downloads/Downloads.html#_Toc105</code></p></li><li><p>F&uuml;r den Zaurus existiert eine .ipk-Datei, womit die Installation recht einfach ist.</p></li><li><p>Danach muss der Inhalt der CacheWolf .zip-Datei in ein Verzeichnis deiner Wahl auf den Zaurus &uuml;bertragen werden.</p></li><li><p>Das Programm wird mit CacheWolf.ewe gestartet.</p></li></ul></div></div></div></div></div></body></html>